In [1]:
import pandas as pd; import numpy as np; import janitor as jn

In [2]:
events = pd.read_csv('/Users/samuel.oranyeli/Downloads/results.csv', parse_dates=['start','end']).iloc[:, 1:]

In [3]:
events.dtypes

id                   int64
name                object
audience             int64
start       datetime64[ns]
sponsor             object
end         datetime64[ns]
dtype: object

In [4]:
a = (events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    # ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = True,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

a

OMP: Info #276: omp_set_nested routine deprecated, please use omp_set_max_active_levels instead.

        left                                          right  \
          id               start                 end     id
0          1 2022-11-19 10:00:00 2022-11-19 10:15:00      1
1          2 2015-09-27 15:00:00 2015-09-27 15:11:00      2
2          3 2019-11-12 18:00:00 2019-11-12 18:53:00      3
3          4 2019-12-24 22:00:00 2019-12-24 22:11:00      4
4          5 2028-06-20 12:00:00 2028-06-20 12:31:00      5
...      ...                 ...                 ...    ...
33696  29995 2016-09-04 14:00:00 2016-09-04 14:32:00  12296
33697  29996 2007-06-16 13:00:00 2007-06-16 13:12:00  29996
33698  29997 2026-02-25 22:00:00 2026-02-25 22:43:00  29997
33699  29998 1992-03-08 22:00:00 1992-03-08 22:48:00  29998
33700  29999 2006-01-01 05:00:00 2006-01-01 05:52:00  29999


                    start                 end
0     2022-11-19 10:00:00 2022-11-19 10:15:00
1     2015-09-27 15:00:00 2015-09-27 15:11:00
2     2019-11-12 18:00:00 2019-11-12 18:53:00
3     2019-12-24 22:00:00 2019-12-24 22:11:00
4     2028-06-20 12:00:00 2028-06-20 12:31:00
...                   ...                 ...
33696 2016-09-04 14:00:00 2016-09-04 14:50:00
33697 2007-06-16 13:00:00 2007-06-16 13:12:00
33698 2026-02-25 22:00:00 2026-02-25 22:43:00
33699 1992-03-08 22:00:00 1992-03-08 22:48:00
33700 2006-01-01 05:00:00 2006-01-01 05:52:00

[33701 rows x 6 columns]

In [5]:
%%timeit
(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    # ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = True,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

18.9 ms ± 59.8 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [6]:
%%timeit
(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    # ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = False,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

18.7 ms ± 94 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [7]:
(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = False,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

       left                                          right  \
         id               start                 end     id
0        10 1993-11-27 12:00:00 1993-11-27 12:37:00   2345
1        15 1993-04-04 16:00:00 1993-04-04 18:00:00  11178
2        17 2030-10-25 07:00:00 2030-10-25 07:27:00  19605
3        26 2005-10-04 17:00:00 2005-10-04 17:18:00   8218
4        35 2024-05-02 15:00:00 2024-05-02 15:35:00   6916
...     ...                 ...                 ...    ...
3697  29966 2000-08-26 11:00:00 2000-08-26 13:00:00  29375
3698  29971 2018-05-18 04:00:00 2018-05-18 04:18:00  24173
3699  29978 1992-06-07 22:00:00 1992-06-07 22:23:00    981
3700  29984 2025-06-05 03:00:00 2025-06-05 03:17:00  19051
3701  29995 2016-09-04 14:00:00 2016-09-04 14:32:00  12296


                   start                 end
0    1993-11-27 10:00:00 1993-11-27 12:00:00
1    1993-04-04 17:00:00 1993-04-04 17:22:00
2    2030-10-25 06:00:00 2030-10-25 08:00:00
3    2005-10-04 17:00:00 2005-10-04 17:27:00
4    2024-05-02 15:00:00 2024-05-02 15:36:00
...                  ...                 ...
3697 2000-08-26 13:00:00 2000-08-26 13:53:00
3698 2018-05-18 04:00:00 2018-05-18 04:36:00
3699 1992-06-07 22:00:00 1992-06-07 22:30:00
3700 2025-06-05 01:00:00 2025-06-05 03:00:00
3701 2016-09-04 14:00:00 2016-09-04 14:50:00

[3702 rows x 6 columns]

In [8]:
# # %%timeit
# (events
# .conditional_join(
#     events,
#     ('start', 'end', '>='),
#     ('end', 'start', '<='),
#     ('id', 'id', '!='),
#     # ('audience','audience','>'),
#     use_numba = True,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [9]:
C=dict(key=[f"c{num}" for num in range(1,8)],
       vol=[35,15,5,35,18,90,17],
       profit=[45,35,55,12,15,55,11],
       unitsSold=[15,10,30,10,15,80,2],
       keyy = range(1,8)
       )
C=pd.DataFrame(C)


D=dict(key=[f'd{num}' for num in range(1,9)],
       vol=[20,50,15,16,40,20,40,2],
       profit=[30,10,12,52,35,20,30,57],
       unitsSold=[20,35,10,12,40,30,5,15],
       keyy=range(8,0,-1)
       )
D=pd.DataFrame(D)

In [10]:
C = pd.concat([C]*40*40)
D = pd.concat([D]*40*40)

In [11]:
(C
.conditional_join(
    D, 
    
    ('profit','profit','>='),
    # ('keyy','keyy','=='),
  # ('unitsSold','unitsSold','>='),
  ('vol','vol','<='),
  # ('vol','profit','>'),
    use_numba=True)
)

         left                           right
          key vol profit unitsSold keyy   key vol profit unitsSold keyy
0          c1  35     45        15    1    d5  40     35        40    4
1          c1  35     45        15    1    d5  40     35        40    4
2          c1  35     45        15    1    d5  40     35        40    4
3          c1  35     45        15    1    d5  40     35        40    4
4          c1  35     45        15    1    d5  40     35        40    4
...       ...  ..    ...       ...  ...   ...  ..    ...       ...  ...
48639995   c7  17     11         2    7    d2  50     10        35    7
48639996   c7  17     11         2    7    d2  50     10        35    7
48639997   c7  17     11         2    7    d2  50     10        35    7
48639998   c7  17     11         2    7    d2  50     10        35    7
48639999   c7  17     11         2    7    d2  50     10        35    7

[48640000 rows x 10 columns]

In [12]:
%%timeit
(C
.conditional_join(
    D, 
    
    ('profit','profit','>='),
    # ('keyy','keyy','=='),
  # ('unitsSold','unitsSold','>='),
  ('vol','vol','<='),
  # ('vol','profit','>'),
    use_numba=True)
)

944 ms ± 6.85 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [21]:
%%timeit
(C
.conditional_join(
    D, 
    
    ('profit','profit','>='),
    # ('keyy','keyy','=='),
  # ('unitsSold','unitsSold','>='),
  ('vol','vol','<='),
  # ('vol','profit','>'),
    use_numba=False)
)

1.4 s ± 12.2 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [13]:
C

   key  vol  profit  unitsSold  keyy
0   c1   35      45         15     1
1   c2   15      35         10     2
2   c3    5      55         30     3
3   c4   35      12         10     4
4   c5   18      15         15     5
..  ..  ...     ...        ...   ...
2   c3    5      55         30     3
3   c4   35      12         10     4
4   c5   18      15         15     5
5   c6   90      55         80     6
6   c7   17      11          2     7

[11200 rows x 5 columns]

In [14]:
D.sort_values('profit')

   key  vol  profit  unitsSold  keyy
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
..  ..  ...     ...        ...   ...
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1

[12800 rows x 5 columns]

In [15]:
D.sort_values('vol')

   key  vol  profit  unitsSold  keyy
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1
..  ..  ...     ...        ...   ...
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7

[12800 rows x 5 columns]

In [16]:
# %%timeit
# (C
# .conditional_join(
#     D, 
    
#     ('profit','profit','>='),
#     # ('keyy','keyy','=='),
#   # ('unitsSold','unitsSold','>='),
#   ('vol','vol','<='),
#   # ('vol','profit','>'),
#     use_numba=False)
# )

In [17]:
C

   key  vol  profit  unitsSold  keyy
0   c1   35      45         15     1
1   c2   15      35         10     2
2   c3    5      55         30     3
3   c4   35      12         10     4
4   c5   18      15         15     5
..  ..  ...     ...        ...   ...
2   c3    5      55         30     3
3   c4   35      12         10     4
4   c5   18      15         15     5
5   c6   90      55         80     6
6   c7   17      11          2     7

[11200 rows x 5 columns]

In [18]:
D.sort_values('profit')

   key  vol  profit  unitsSold  keyy
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
1   d2   50      10         35     7
..  ..  ...     ...        ...   ...
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1
7   d8    2      57         15     1

[12800 rows x 5 columns]

In [19]:
# f=(C
# .conditional_join(
#     D, 
    
#     ('profit','profit','>='),
#     # ('keyy','keyy','=='),
#    ('unitsSold','unitsSold','>='),
#  # ('vol','vol','<='),
#   # ('vol','profit','>'),
#     use_numba=True)
# )
# f

In [20]:
np.array(f[1][0])

NameError: name 'f' is not defined

In [ ]:
# %timeit np.empty((200_000_000,8),dtype=np.uint64)

In [ ]:
f.shape

AttributeError: 'tuple' object has no attribute 'shape'